CSI API ETABS v1
cAnalysisResults Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cAnalysisResults
Public Interface cAnalysisResults
Dim instance As cAnalysisResults
public interface class cAnalysisResults
type cAnalysisResults =  interface end
The cAnalysisResults type exposes the following members.
Properties
Name | Description
Setup
Top
Methods
Name | Description
AreaForceShell
 Reports the area forces for the specified area elements that are assigned shell section properties (not plane or asolid properties). Note that the forces reported are per unit of in-plane length.
AreaJointForceShell
 Reports the area joint forces for the point elements at each corner of the specified area elements that have shell-type properties
AreaStrainShell
AreaStrainShellLayered
AreaStressShell
 Reports the area stresses for the specified area elements that are assigned shell section properties. Stresses are reported at each point element associated with the area element
AreaStressShellLayered
 Reports the area stresses for the specified area elements that are assigned layered shell section properties
AssembledJointMass
 Reports the assembled joint masses for the specified point elements
AssembledJointMass_1
 Reports the assembled joint masses for the specified point elements
BaseReact
 Reports the structure total base reactions
BaseReactWithCentroid
 Reports the structure total base reactions and includes information on the centroid of the translational reaction forces
BucklingFactor
 Reports buckling factors obtained from buckling load cases
FrameForce
 Reports the frame forces for the specified line elements
FrameJointForce
 Reports the frame joint forces for the point elements at each end of the specified line elements
GeneralizedDispl
 Reports the displacement values for the specified generalized displacements
JointAcc
 Reports the joint accelerations for the specified point elements. The accelerations reported by this function are relative accelerations.
JointAccAbs
 Reports the joint absolute accelerations for the specified point elements. Absolute and relative accelerations are the same, except when reported for time history load cases subjected to acceleration loading
JointDispl
 Reports the joint displacements for the specified point elements. The displacements reported by this function are relative displacements
JointDisplAbs
 Reports the absolute joint displacements for the specified point elements. Absolute and relative displacements are the same except when reported for time history load cases subjected to acceleration loading
JointDrifts
 Reports the joint drifts
JointReact
 Reports the joint reactions for the specified point elements. The reactions reported are from restraints, springs and grounded (one-joint) links.
JointVel
 Reports the joint velocities for the specified point elements. The velocities reported by this function are relative velocities
JointVelAbs
 Reports the joint absolute velocities for the specified point elements. Absolute and relative velocities are the same, except when reported for time history load cases subjected to acceleration loading
LinkDeformation
 Reports the link internal deformations
LinkForce
 Reports the link forces at the point elements at the ends of the specified link elements
LinkJointForce
 Reports the joint forces at the point elements at the ends of the specified link elements
ModalLoadParticipationRatios
 Reports the modal load participation ratios for each selected modal analysis case
ModalParticipatingMassRatios
 Reports the modal participating mass ratios for each mode of each selected modal analysis case
ModalParticipationFactors
 Reports the modal participation factors for each mode of each selected modal analysis case
ModalPeriod
 Reports the modal period, cyclic frequency, circular frequency and eigenvalue for each selected modal load case
ModeShape
 Reports the modal displacements (mode shapes) for the specified point elements
PanelZoneDeformation
 Reports the panel zone (link) internal deformations
PanelZoneForce
 Reports the panel zone (link) forces at the point elements at the ends of the specified panel zone (link) elements
PierForce
 Retrieves pier forces for any defined pier objects in the model
SectionCutAnalysis
 Reports the section cut force for sections cuts that are specified to have an Analysis (F1, F2, F3, M1, M2, M3) result type
SectionCutDesign
 Reports the section cut force for sections cuts that are specified to have a Design (P, V2, V3, T, M2, M3) result type
SpandrelForce
 Retrieves spandrel forces for any defined spandrel objects in the model
StoryDrifts
 Reports the story drifts
Top
See Also
Reference
ETABSv1 Namespace